src/cfe/МенеджерСинхронизаций/Catalogs/МС_ЗапросыКВнешнимИсточникам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>МС_ЗапросыКВнешнимИсточникам</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресатПерсонализированнойРассылки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнтерактивнаяЗагрузка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьКодЗапроса</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьУведомления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогСохраненияНовыхФайлов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогСохраненияОбработанныхФайлов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогСохраненияОшибок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогФайлов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КопироватьФайлыВЛокальныйКаталог</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаскаФайлов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МодифицироватьИмяФайла</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Процедура</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцедураПодготовкиДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособЗапросаДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОбмена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТЧЗначенияПараметров</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТЧНастройкаСоответствий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТЧУведомления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалятьФайлыИзКаталогаИсточника</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НастройкиДоступности</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторПользователя</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Просмотр</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Редактирование</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cfe/МенеджерСинхронизаций/Catalogs/МС_ЗапросыКВнешнимИсточникам/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// При создании нового элемента
	Если Объект.Ссылка.Пустая()
		Или Объект.СпособЗапросаДанных = "" Тогда
		Объект.СпособЗапросаДанных = "ПроизвольныйРезультат";
	КонецЕсли; 
	
	Элементы.ГруппаСпособыПолученияДанных.ТекущаяСтраница = Элементы[ИмяСтраницыСпособаЗапросаДанных(Объект.СпособЗапросаДанных)];
	
	Если Не Пользователи.РолиДоступны("МС_ОсновнаяРоль") 
		И Не Пользователи.РолиДоступны("ПолныеПрава") Тогда
		
		// Видимость элементов
		Элементы.ФормаСохранитьНастройкиВФайл.Видимость = Ложь;
		Элементы.ФормаЗагрузитьНастройкиИзФайла.Видимость = Ложь;
		Элементы.ТипОбмена.Видимость = Ложь;
		Элементы.ПроцедураПодготовкиДанных.Видимость = Ложь;
		Элементы.Процедура.Видимость = Ложь;
		Элементы.ИнтерактивнаяЗагрузка.Видимость = Ложь;
		Элементы.ГруппаПолучениеДанных.Видимость = Ложь;
		Элементы.ГруппаУведомления.Видимость = Ложь;
		Элементы.ГруппаНастройкиДоступности.Видимость = Ложь;
		Элементы.ДействияПослеСинхронизации.Видимость = Ложь;
		Элементы.ЗначенияПараметровПолучитьПараметрыИзПроцедурыЗагрузки.Видимость = Ложь;
		
		// Возможность редактирования
		Отбор = Новый Структура("ИдентификаторПользователя, Редактирование", 
								ПараметрыСеанса.МС_ИдентификаторТекущегоПользователя, Истина);
		ЭтотОбъект.ТолькоПросмотр = Объект.НастройкиДоступности.НайтиСтроки(Отбор).Количество() = 0;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ТЧЗначенияПараметров) Тогда
		ЗначенияПараметров.Загрузить(ОбщегоНазначения.ЗначениеИзСтрокиXML(Объект.ТЧЗначенияПараметров));
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(Объект.ТЧНастройкаСоответствий) Тогда
		НастройкаСоответствий.Загрузить(ОбщегоНазначения.ЗначениеИзСтрокиXML(Объект.ТЧНастройкаСоответствий));
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(Объект.ТЧУведомления) Тогда
		Уведомления.Загрузить(ОбщегоНазначения.ЗначениеИзСтрокиXML(Объект.ТЧУведомления));
	КонецЕсли;
	
	НастройкиДоступностиЗаполнитьПользователя();
	
	// Ограничение типа поля Получатель ТЧ Уведомления
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("СправочникСсылка.РолиИсполнителей"));
	МассивТипов.Добавить(Тип("СправочникСсылка.Пользователи"));
	МассивТипов.Добавить(Тип("Строка"));
	КвалификаторыСтроки100 = Новый КвалификаторыСтроки(100);
	ДопустимыеТипы = Новый ОписаниеТипов(МассивТипов, , КвалификаторыСтроки100);
    Элементы.УведомленияПолучатель.ОграничениеТипа = ДопустимыеТипы;
	
	// Ограничение типа поля Пользователь ТЧ НастройкиДоступности
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("СправочникСсылка.Пользователи"));
	ДопустимыеТипы = Новый ОписаниеТипов(МассивТипов);
	Элементы.НастройкиДоступностиПользователь.ОграничениеТипа = ДопустимыеТипы;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьКоличествоСтрокВЗаголовке("ГруппаЗначенияПараметров", "Значения параметров", "ЗначенияПараметров");
	УстановитьКоличествоСтрокВЗаголовке("ГруппаНастройкаСоответствий", "Настройка соответствий", "НастройкаСоответствий");
	//УстановитьКоличествоСтрокВЗаголовке("ГруппаНастройкиДоступности", "Доступность", "НастройкиДоступности");
	УстановитьКоличествоСтрокВЗаголовке("ГруппаУведомления", "Уведомления", "Уведомления");
	
	НастроитьВидимостьЭлементовКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьВидимостьЭлементовКлиент()
	Элементы.КодЗапроса.Видимость = Объект.ИспользоватьКодЗапроса;
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьКодЗапросаПриИзменении(Элемент)
	НастроитьВидимостьЭлементовКлиент();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТекстНастроек(ОбъектСсылка)
	
	СтруктураНастроек = Новый Структура;
	
    Метаданное = ОбъектСсылка.Метаданные();
	
	Реквизиты = Новый Структура;
	
    Для каждого Реквизит из Метаданное.Реквизиты Цикл
		
		Реквизиты.Вставить(Реквизит.Имя, ОбъектСсылка[Реквизит.Имя]);
		
	КонецЦикла;
	
	СтруктураНастроек.Вставить("Реквизиты", Реквизиты);
	
	ТабличныеЧасти = Новый Структура;
	
	Для каждого ТЧ из Метаданное.ТабличныеЧасти Цикл
		
		Если ОбъектСсылка[ТЧ.Имя].Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ТабличнаяЧасть = Новый Массив;
		
		Для Индекс = 0 по ОбъектСсылка[ТЧ.Имя].Количество()-1 Цикл
			СтрокаТЧ = Новый Структура;
			
			Для каждого РеквизитТЧ Из ТЧ.Реквизиты Цикл
				ОбъектСсылкаСТрокаТЧ = ОбъектСсылка[ТЧ.Имя][Индекс];
				СтрокаТЧ.Вставить(РеквизитТЧ.Имя, ОбъектСсылкаСТрокаТЧ[РеквизитТЧ.Имя]);
			КонецЦикла;
			ТабличнаяЧасть.Добавить(СтрокаТЧ);
		КонецЦикла;
		
		ТабличныеЧасти.Вставить(ТЧ.Имя, ТабличнаяЧасть);
		
	КонецЦикла;        
	
	СтруктураНастроек.Вставить("ТабличныеЧасти", ТабличныеЧасти);
	
	ТекстНастроек = ОбщегоНазначения.ЗначениеВСтрокуXML(СтруктураНастроек);
	
	Возврат ТекстНастроек;
	
КонецФункции

&НаКлиенте
Процедура СохранитьНастройкиВФайл(Команда)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	Диалог.Фильтр = "Файл xml|*.xml";
	Диалог.Заголовок = "Выбор файла xml";
	ОповещениеЗавершения = Новый ОписаниеОповещения("ВыборФайлаСохранениеЗавершение", ЭтотОбъект);
	Диалог.Показать(ОповещениеЗавершения);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборФайлаСохранениеЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы <> Неопределено Тогда
		
		ПутьКФайлу = ВыбранныеФайлы[0];
		
		ТекстНастроек = ПолучитьТекстНастроек(Объект.Ссылка);
		
		Файл = Новый ЗаписьТекста(ПутьКФайлу);
		Файл.ЗаписатьСтроку(ТекстНастроек);
		Файл.Закрыть();
		
		Сообщить("Настройки сохранены в файл.");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьНастройкиИзФайла(Команда)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Фильтр = "Файл xml|*.xml";
	Диалог.Заголовок = "Выбор файла xml";
	ОповещениеЗавершения = Новый ОписаниеОповещения("ВыборФайлаЧтениеЗавершение", ЭтотОбъект);
	Диалог.Показать(ОповещениеЗавершения);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборФайлаЧтениеЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы <> Неопределено Тогда
		
		ПутьКФайлу = ВыбранныеФайлы[0];
		
		Файл = Новый ЧтениеТекста(ПутьКФайлу);
		ТекстНастроек = Файл.Прочитать();
		Файл.Закрыть();
		
		СтруктураНастроек = ПолучитьНастройкиИзТекста(ТекстНастроек);
		
		ЗаполнитьЗначенияСвойств(Объект, СтруктураНастроек.Реквизиты);
		
		Для каждого ТабличнаяЧасть Из СтруктураНастроек.ТабличныеЧасти Цикл
			
			Объект[ТабличнаяЧасть.Ключ].Очистить();
			
			Для каждого СтрокаТЧНастроек Из ТабличнаяЧасть.Значение Цикл
				
				НоваяСтрокаТЧ = Объект[ТабличнаяЧасть.Ключ].Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаТЧ, СтрокаТЧНастроек);
				
			КонецЦикла; 
			
		КонецЦикла; 

	КонецЕсли;
	
	НастроитьВидимостьЭлементовКлиент();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьНастройкиИзТекста(ТекстНастроек)
	
	СтруктураНастроек = ОбщегоНазначения.ЗначениеИзСтрокиXML(ТекстНастроек);
	
	Возврат СтруктураНастроек;
	
КонецФункции

&НаСервере
Процедура ПолучитьПараметрыИзПроцедурыЗагрузкиНаСервере()
	
	НастройкиСинхронизации = Неопределено;
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ТолькоДляЗаполненияЗначенийПараметров", Истина);
	РезультатЗапросаКИсточнику = Неопределено;
	РезультатЗагрузки = Неопределено;
	
	Если ЗначениеЗаполнено(Объект.ПроцедураПодготовкиДанных) Тогда
		Выполнить(Объект.ПроцедураПодготовкиДанных + "(НастройкиСинхронизации, СтруктураПараметров, РезультатЗапросаКИсточнику, РезультатЗагрузки)");
	КонецЕсли; 
	Если ЗначениеЗаполнено(Объект.Процедура) Тогда
		Выполнить(Объект.Процедура + "(НастройкиСинхронизации, СтруктураПараметров, РезультатЗапросаКИсточнику, РезультатЗагрузки)");
	КонецЕсли; 
	
	Если СтруктураПараметров.Свойство("ЗначенияПараметров") Тогда
		Для каждого СтрокаСтруктураЗначенийПараметров Из СтруктураПараметров.ЗначенияПараметров Цикл
			ПараметрыОтбораСтрок = Новый Структура;
			ПараметрыОтбораСтрок.Вставить("ИмяПараметра", СтрокаСтруктураЗначенийПараметров.Ключ);
			НайденныеСтрокиПараметров = ЗначенияПараметров.НайтиСтроки(ПараметрыОтбораСтрок);
			Если НайденныеСтрокиПараметров.Количество() = 0 Тогда
				НоваяСтрокаПараметров = ЗначенияПараметров.Добавить();
				НоваяСтрокаПараметров.ИмяПараметра = СтрокаСтруктураЗначенийПараметров.Ключ;
				НоваяСтрокаПараметров.ЗначениеПараметра = СтрокаСтруктураЗначенийПараметров.Значение;			
			КонецЕсли; 
		КонецЦикла; 
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьПараметрыИзПроцедурыЗагрузки(Команда)
	ПолучитьПараметрыИзПроцедурыЗагрузкиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СпособЗапросаДанныхПриИзменении(Элемент)
	
	Элементы.ГруппаСпособыПолученияДанных.ТекущаяСтраница = Элементы[ИмяСтраницыСпособаЗапросаДанных(Объект.СпособЗапросаДанных)];
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИмяСтраницыСпособаЗапросаДанных(СпособЗапросаДанных)
	
	// Страница по-умолчанию
	Если СпособЗапросаДанных = "" Тогда
		СпособЗапросаДанных = "ПроизвольныйРезультат";
	КонецЕсли; 
	
	Возврат "Группа" + СпособЗапросаДанных;
	
КонецФункции

&НаКлиенте
Процедура КаталогФайловНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
		
	Режим = РежимДиалогаВыбораФайла.ВыборКаталога; 
	ДиалогОткрытия = Новый ДиалогВыбораФайла(Режим); 
	ДиалогОткрытия.Каталог = Объект.КаталогСохраненияНовыхФайлов;  
	ДиалогОткрытия.Заголовок = "Выберите каталог"; 	
	ДиалогОткрытия.МножественныйВыбор = Ложь;
	Оповещение = Новый ОписаниеОповещения("ВыборКаталога_Завершение", ЭтотОбъект, "КаталогФайлов");
	ДиалогОткрытия.Показать(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура КаталогСохраненияНовыхФайловНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
		
	Режим = РежимДиалогаВыбораФайла.ВыборКаталога; 
	ДиалогОткрытия = Новый ДиалогВыбораФайла(Режим); 
	ДиалогОткрытия.Каталог = Объект.КаталогСохраненияНовыхФайлов;  
	ДиалогОткрытия.Заголовок = "Выберите каталог"; 	
	ДиалогОткрытия.МножественныйВыбор = Ложь;
	Оповещение = Новый ОписаниеОповещения("ВыборКаталога_Завершение", ЭтотОбъект, "КаталогСохраненияНовыхФайлов");
	ДиалогОткрытия.Показать(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура КаталогСохраненияОбработанныхФайловНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
		
	Режим = РежимДиалогаВыбораФайла.ВыборКаталога; 
	ДиалогОткрытия = Новый ДиалогВыбораФайла(Режим); 
	ДиалогОткрытия.Каталог = Объект.КаталогСохраненияНовыхФайлов;  
	ДиалогОткрытия.Заголовок = "Выберите каталог"; 	
	ДиалогОткрытия.МножественныйВыбор = Ложь;
	Оповещение = Новый ОписаниеОповещения("ВыборКаталога_Завершение", ЭтотОбъект, "КаталогСохраненияОбработанныхФайлов");
	ДиалогОткрытия.Показать(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура КаталогСохраненияОшибокНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
		
	Режим = РежимДиалогаВыбораФайла.ВыборКаталога; 
	ДиалогОткрытия = Новый ДиалогВыбораФайла(Режим); 
	ДиалогОткрытия.Каталог = Объект.КаталогСохраненияНовыхФайлов;  
	ДиалогОткрытия.Заголовок = "Выберите каталог"; 	
	ДиалогОткрытия.МножественныйВыбор = Ложь;
	Оповещение = Новый ОписаниеОповещения("ВыборКаталога_Завершение", ЭтотОбъект, "КаталогСохраненияОшибок");
	ДиалогОткрытия.Показать(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборКаталога_Завершение(Результат, Параметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Сообщить("Каталог не выбран");
		Возврат;
	Иначе
		Для каждого РезультатВыбора Из Результат Цикл
			Объект[Параметры] = РезультатВыбора;
		КонецЦикла; 
	КонецЕсли;
	
КонецПроцедуры	

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ТЧЗначенияПараметров = ОбщегоНазначения.ЗначениеВСтрокуXML(ЗначенияПараметров.Выгрузить());
	ТекущийОбъект.ТЧНастройкаСоответствий = ОбщегоНазначения.ЗначениеВСтрокуXML(НастройкаСоответствий.Выгрузить());
	ТекущийОбъект.ТЧУведомления = ОбщегоНазначения.ЗначениеВСтрокуXML(Уведомления.Выгрузить());
	
 КонецПроцедуры

&НаКлиенте
Процедура ЗначенияПараметровПриИзменении(Элемент)
	
	УстановитьКоличествоСтрокВЗаголовке("ГруппаЗначенияПараметров", "Значения параметров", "ЗначенияПараметров");
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаСоответствийПриИзменении(Элемент)
	
	УстановитьКоличествоСтрокВЗаголовке("ГруппаНастройкаСоответствий", "Настройка соответствий", "НастройкаСоответствий");
	
КонецПроцедуры

&НаКлиенте
Процедура УведомленияПриИзменении(Элемент)
	
	УстановитьКоличествоСтрокВЗаголовке("ГруппаУведомления", "Уведомления", "Уведомления");
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьКоличествоСтрокВЗаголовке(ИмяЭлементаЗаголовка, ИмяЗаголовка, ПутьКДаннымТЧ)
	
	Элементы[ИмяЭлементаЗаголовка].Заголовок = 
						СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						(ИмяЗаголовка + " (%1)"), ЭтаФорма[ПутьКДаннымТЧ].Количество());
						
КонецПроцедуры

&НаКлиенте
Процедура НастройкиДоступностиПользовательПриИзменении(Элемент)
		
	ТекущаяСтрока = Элементы.НастройкиДоступности.ТекущиеДанные;
	
	ТекущаяСтрока.ИдентификаторПользователя = ТекущаяСтрока.Пользователь.УникальныйИдентификатор();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	НастройкиДоступностиЗаполнитьПользователя();
КонецПроцедуры

&НаСервере
Процедура НастройкиДоступностиЗаполнитьПользователя()

	Для каждого СтрокаНастройкиДоступности Из Объект.НастройкиДоступности Цикл
		ИдентификаторПользователя = СтрокаНастройкиДоступности.ИдентификаторПользователя;
		СтрокаНастройкиДоступности.Пользователь = Справочники.Пользователи.ПолучитьСсылку(ИдентификаторПользователя);
	КонецЦикла; 

КонецПроцедуры
